app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)
    @house.user = current_user

    respond_to do |format|
      if @house.save
---
INSERT INTO "houses" ("name", "address", "city", "state", "zip", "note", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"